abduction 8
abductive 6
abnormal 5
abnormality 6
about 48
abstract 40
abstraction 23
abstractions 7
academic 9
accelerated 7
accelerating 8
acceleration 10
access 113
accesses 6
accessibility 8
accuracy 42
accurate 38
accurately 6
achieving 10
acoustic 6
acquiring 7
acquisition 44
across 26
action 71
actionable 7
actions 28
active 123
activities 17
activity 32
adaboost 7
adaptable 8
adaptation 35
adapting 19
adaptive 212
adaptively 5
adding 13
additive 12
addressing 6
advanced 20
adversarial 6
advertising 19
advice 10
advisor 6
affective 6
against 18
agent 107
agents 70
agglomerative 6
aggregate 39
aggregates 23
aggregating 7
aggregation 75
agreement 6
ahead 5
aided 10
air 7
algebra 18
algebraic 18
algorithm 394
algorithmic 9
algorithms 265
alignment 27
all 15
allocation 30
almost 9
alpha 7
alternating 6
alternative 15
ambiguity 8
ambiguous 10
among 24
analogical 6
analogy 12
analyses 4
analysis 463
analytical 10
analytics 8
analyzer 5
analyzing 36
anatomy 8
anchor 9
and 2969
annotated 6
annotating 5
annotation 52
annotations 18
anomalies 9
anomaly 27
anonymity 20
anonymization 17
anonymized 5
anonymizing 5
anonymous 13
another 7
answer 46
answering 109
answers 24
anti 7
any 6
anytime 22
appearance 12
application 175
applications 180
applied 15
applying 26
approach 551
approaches 47
approximate 131
approximately 5
approximating 19
approximation 75
approximations 10
aqualogic 6
arabic 10
arbitrarily 5
arbitrary 21
arc 12
architecture 73
architectures 23
archives 14
are 38
area 17
argument 8
argumentation 14
arithmetic 6
armed 5
array 7
art 13
articles 6
artificial 23
aspect 11
aspects 12
assessing 9
assessment 23
assignment 13
assistant 8
assisted 6
associated 7
association 162
associations 31
associative 19
assumption 6
assurance 6
asymmetric 12
asynchronous 7
attack 7
attacks 20
attention 5
attribute 38
attributes 47
auc 6
auction 17
auctions 33
audio 14
auditing 6
augmented 12
augmenting 6
authentication 6
author 8
authority 12
authorship 5
auto 5
automata 22
automated 73
automatic 214
automatically 31
automating 16
automation 6
autonomic 8
autonomous 47
auxiliary 5
availability 5
available 9
average 21
averaged 5
averaging 7
avoiding 5
aware 68
awareness 12
axiomatic 8
axis 5
back 15
background 15
backtracking 5
bad 6
bag 8
bagging 17
balanced 16
balancing 15
bandit 9
bandwidth 8
bargaining 5
base 19
based 1512
baseline 5
bases 21
basic 10
basis 16
basket 6
batch 23
bayes 63
bayesian 195
behavior 73
behaviors 11
behaviour 10
belief 57
beliefs 9
benchmark 16
benchmarking 7
benefits 8
bernoulli 6
best 36
better 37
between 94
beyond 37
bias 25
biased 26
bid 6
bidding 8
bilingual 9
binary 34
bio 6
bioinformatics 7
biological 30
biology 6
biomedical 23
biometric 6
bipartite 17
bit 9
bitmap 11
blind 14
block 16
blocking 9
blocks 9
blog 14
blogosphere 7
blogs 11
body 7
book 6
books 6
boolean 24
boosted 6
boosting 103
bootstrap 7
bootstrapping 11
border 6
both 18
bottom 16
bound 20
boundary 20
bounded 29
bounding 5
bounds 36
box 8
bpel 6
brain 14
branch 5
branching 9
breadth 5
breaking 12
bregman 7
bridging 17
bringing 8
broadcast 20
browser 18
browsing 50
buffer 8
build 5
building 73
bulk 9
bursty 6
business 63
but 6
cache 36
caching 58
calculation 5
calculus 17
calibration 15
call 9
camera 18
cameras 8
can 21
cancer 8
canonical 5
capture 10
capturing 20
cardinality 18
care 5
carlo 17
cascade 7
cascaded 5
case 106
catalog 7
catalogs 5
categorical 31
categories 18
categorisation 7
categorization 92
categorizing 7
category 16
causal 36
causality 5
cell 8
cellular 6
center 12
centered 11
centers 5
centric 24
centroid 7
chain 17
chaining 6
chains 10
challenge 16
challenges 48
change 49
changes 22
changing 15
channel 10
channels 6
character 6
characteristic 6
characteristics 6
characterization 19
characterizations 6
characterizing 10
characters 5
check 5
checking 26
chemical 11
chinese 33
chip 5
choice 7
choosing 5
citation 10
citations 5
class 107
classes 27
classical 6
classification 546
classifier 78
classifiers 126
classify 9
classifying 29
clause 8
cleaning 21
cleansing 5
click 25
clicks 6
clickthrough 11
client 16
clients 6
clinical 11
clio 5
clique 7
cliques 6
clir 7
closed 63
clouds 7
cluster 103
clustered 12
clustering 665
clusterings 11
clusters 65
coalition 12
coalitional 7
code 14
coded 5
codes 6
coding 8
cognitive 28
coherence 6
coherent 9
collaboration 12
collaborative 122
collection 47
collections 59
collective 17
color 18
column 13
com 5
combination 28
combinations 5
combinatorial 28
combine 8
combined 10
combining 118
commerce 25
commercial 6
commodity 7
common 19
communication 29
communities 34
community 51
compact 27
comparative 31
comparing 35
comparison 65
comparisons 18
competitive 12
compilation 16
compiling 10
complete 28
completeness 6
completion 7
complex 99
complexity 84
component 40
components 15
composing 5
composite 14
composition 35
compositional 8
compound 10
comprehensive 7
compressed 24
compressing 9
compression 40
computation 83
computational 40
computations 5
computer 51
computing 81
concept 78
concepts 31
conceptual 23
concise 7
concurrency 9
concurrent 24
condensed 6
condition 5
conditional 70
conditions 14
confidence 19
configurable 6
configuration 15
conflict 11
conformant 6
conjunctive 20
connected 19
connecting 8
connections 8
connectivity 9
conquer 6
conscious 13
consensus 12
considerations 5
considering 5
consistency 61
consistent 20
constant 10
constrained 65
constraint 136
constraints 146
construct 5
constructing 26
construction 68
consumer 7
containing 5
containment 19
content 167
contents 9
context 105
contexts 8
contextual 31
contingency 5
continuous 129
contours 5
contract 9
contrast 7
control 91
controlled 13
controlling 5
convergence 15
conversation 6
conversational 9
conversations 5
convex 19
convolution 6
cooperation 6
cooperative 32
coordinate 6
coordinated 5
coordination 31
core 25
corpora 22
corpus 25
correcting 7
correction 11
correctness 7
correlated 25
correlation 64
correlations 11
correspondence 13
correspondences 7
cost 92
costs 11
count 7
counting 27
counts 7
coupled 10
coupling 9
covariance 7
coverage 15
covering 14
crawl 5
crawler 10
crawling 25
create 6
creating 15
creation 13
criteria 23
criterion 16
critical 5
cross 91
crowd 6
csp 16
csps 13
cube 24
cubes 29
cubing 5
cues 7
currency 6
current 5
curse 5
curve 7
curves 16
customer 35
customers 7
cut 12
cuts 5
cyclic 5
data 1987
database 324
databases 353
datalog 10
dataset 6
datasets 67
dbms 24
dealing 8
debugging 10
decentralized 17
decidability 5
decision 179
decisions 7
declarative 24
declustering 6
decomposition 46
decompositions 11
decoupled 6
deduplication 6
deep 23
default 8
defined 9
definition 8
definitional 6
definitions 7
deformable 10
degree 7
delay 8
delayed 5
deletion 8
delivery 17
delta 7
demand 22
demonstration 18
dense 20
density 64
dependence 12
dependencies 44
dependency 32
dependent 28
deployment 6
depth 17
deriving 15
descent 7
describing 5
description 45
descriptions 24
descriptors 10
design 113
designing 18
desktop 9
detect 15
detecting 83
detection 320
detector 5
determination 9
determining 14
deterministic 17
developers 5
developing 13
development 30
device 7
devices 24
diagnosability 6
diagnosing 4
diagnosis 34
diagnostic 6
diagrams 12
dialog 6
dialogue 8
dictionaries 6
dictionary 6
difference 21
differences 5
different 38
differential 9
difficult 6
difficulty 7
diffusion 13
digital 39
dimension 33
dimensional 169
dimensionality 60
dimensions 12
direct 32
directed 30
directions 8
directories 13
directory 5
dirichlet 27
disambiguation 37
disclosure 6
discourse 6
discover 7
discovering 104
discovery 225
discrete 32
discretization 17
discriminant 52
discriminating 7
discrimination 6
discriminative 57
discussion 5
disease 10
disjunction 5
disjunctive 13
disk 17
disparate 5
disparity 6
display 5
displays 5
dissemination 22
dissimilarity 11
distance 94
distances 9
distillation 7
distinct 6
distinguishing 8
distributed 271
distribution 53
distributional 6
distributions 39
divergence 8
diverse 17
diversity 18
divide 12
dna 6
document 276
documents 218
does 13
domain 124
domains 61
dominance 9
dominant 7
don 5
down 20
dream 5
drift 7
drifting 8
driven 96
drug 7
dtds 5
dual 20
duality 7
duplicate 27
duplicates 9
during 10
dynamic 250
dynamical 11
dynamically 13
dynamics 25
early 16
earth 9
easy 9
economic 6
edge 16
edges 5
edit 5
editing 6
education 7
effect 14
effective 118
effectively 5
effectiveness 30
effects 26
efficiency 24
efficient 662
efficiently 51
effort 10
elastic 5
electronic 23
element 9
elements 6
elicitation 13
eliminating 8
elimination 11
email 35
emails 6
embedded 17
embedding 29
embeddings 6
emergence 6
emerging 23
emotions 6
empirical 43
enabled 12
enabling 28
encoded 6
encoding 16
encodings 5
end 20
energy 19
engine 128
engineering 37
engines 46
english 13
enhance 13
enhanced 37
enhancing 27
enough 10
ensemble 60
ensembles 42
entailment 7
enterprise 30
entities 22
entity 47
entropy 38
enumeration 5
environment 72
environments 73
episodes 12
epistemic 9
equation 5
equations 6
equilibria 11
equilibrium 10
equivalence 22
error 65
errors 8
estimate 8
estimates 13
estimating 51
estimation 159
estimator 7
estimators 12
euclidean 10
evaluating 87
evaluation 254
evaluations 5
event 97
events 33
evidence 32
evolution 50
evolutionary 45
evolving 42
exact 19
examining 5
example 26
examples 30
exceptions 5
exchange 25
executing 5
execution 42
existing 5
expansion 57
expectation 21
expectations 8
expected 15
expensive 8
experience 24
experiences 9
experiment 11
experimental 36
experimenting 5
experiments 31
expert 31
expertise 15
experts 18
explaining 9
explanation 13
explanations 13
explicit 15
exploit 5
exploitation 6
exploiting 93
exploration 58
exploratory 12
exploring 51
exponential 11
expression 52
expressions 29
expressive 28
expressiveness 5
extended 29
extending 30
extensible 13
extension 22
extensions 13
external 19
extract 6
extracting 64
extraction 215
extreme 9
extremely 6
eye 10
face 45
faceted 8
facial 10
facilitating 5
fact 8
factor 15
factored 14
factorization 33
factors 12
facts 6
failure 12
failures 8
false 14
family 13
fast 220
faster 13
fault 16
feasibility 7
feature 239
features 100
federated 19
feedback 120
few 13
field 21
fields 42
file 18
files 12
filter 22
filtering 149
filters 21
financial 7
find 12
finding 155
fine 14
fingerprint 5
finite 20
first 68
fisher 14
fitting 5
fixed 6
flash 7
flexible 59
flow 26
fly 11
focal 5
focused 25
for 4909
forecasting 11
forest 6
form 23
formal 22
formalization 5
formation 12
forms 6
formulae 5
formulas 16
formulation 13
forward 12
foundation 7
foundations 14
fourier 5
fractal 7
fragment 7
fragments 13
framework 273
fraud 8
free 43
frequency 25
frequent 213
freshness 5
friendly 6
from 722
frontier 6
full 28
fully 11
function 65
functional 31
functions 98
fusion 52
future 18
fuzzy 54
gain 7
gait 5
game 37
games 72
gap 19
gathering 6
gaussian 49
gene 54
general 68
generalization 24
generalized 79
generalizing 9
generated 13
generating 61
generation 112
generative 32
generator 9
generators 10
generic 34
genes 7
genetic 39
genome 8
genomic 11
genomics 7
genre 11
geo 5
geodesic 5
geographic 14
geographical 5
geometric 28
geometry 16
geospatial 6
gesture 5
get 5
getting 7
given 6
global 48
goal 21
goals 15
golog 6
good 34
google 14
government 7
gradient 32
grained 18
gram 7
grammar 10
grammars 10
grammatical 8
grams 8
grand 7
granularity 8
graph 222
graphical 43
graphics 14
graphs 124
greedy 14
grid 29
ground 6
grounding 8
group 31
grouping 19
groups 12
growing 5
growth 10
guarantees 18
guidance 5
guided 26
handling 34
hard 17
hardness 7
hardware 10
hash 11
hashing 6
head 5
health 7
help 12
heterogeneous 62
heuristic 44
heuristics 24
hidden 74
hiding 8
hierarchical 202
hierarchically 10
hierarchies 30
hierarchy 24
high 228
higher 15
highly 39
histogram 14
histograms 20
historical 20
history 19
hits 10
hmm 6
hoc 29
holistic 13
home 6
horizon 6
horn 7
hot 7
how 51
html 16
human 95
humans 6
hybrid 80
hyper 5
hypergraph 8
hyperlinks 7
hypermedia 9
hypertext 12
hypertree 7
hypotheses 7
hypothesis 8
ibm 8
ica 5
iceberg 9
identification 74
identify 11
identifying 47
identity 7
illumination 7
image 207
imagery 6
images 67
imaging 7
imbalance 6
imbalanced 19
imitation 8
impact 34
imperfect 11
implementation 38
implementations 6
implementing 11
implication 5
implications 13
implicit 35
importance 19
important 6
imprecise 13
improve 59
improved 42
improvement 10
improvements 5
improves 6
improving 140
inclusion 7
incomplete 51
inconsistency 7
inconsistent 11
incorporating 36
increasing 8
incremental 105
independence 15
independent 46
index 119
indexed 9
indexes 33
indexing 195
indices 15
indirect 5
individual 7
individuals 6
indoor 9
induced 8
inducing 9
induction 48
inductive 24
industrial 9
industry 10
infer 6
inference 107
inferring 23
infinite 10
influence 25
information 669
informative 23
infrared 5
infrastructure 21
initial 7
initiative 6
injection 5
innovation 5
input 10
inputs 5
inside 5
inspired 7
instance 56
instances 17
insurance 6
integer 5
integrated 44
integrating 71
integration 138
integrity 6
intelligence 40
intelligent 55
intensity 7
intensive 12
intent 9
inter 19
interacting 7
interaction 59
interactions 25
interactive 119
interest 18
interesting 27
interestingness 19
interests 9
interface 41
interfaces 24
internal 6
internet 43
interoperability 5
interpretable 6
interpretation 21
interrelated 7
intersection 8
interval 13
intervals 7
into 73
intra 5
intranet 7
intrinsic 6
introduction 6
intrusion 17
invariant 18
inverse 14
inverted 17
investigating 12
investigation 13
irrelevant 5
isolation 11
isometric 6
issue 5
issues 20
item 29
items 19
itemset 38
itemsets 56
iterated 8
iteration 26
iterative 39
its 84
japanese 6
join 74
joining 6
joins 51
joint 32
judgments 16
just 13
kdd 6
kernel 156
kernels 69
key 19
keyphrase 7
keys 6
keyword 58
keywords 6
knapsack 5
knn 8
know 6
knowing 5
knowledge 293
known 11
label 36
labeled 38
labeling 50
labels 11
lambda 6
landmarks 7
language 231
languages 28
laplacian 5
large 339
lasso 5
latent 72
lattice 14
lattices 5
law 8
laws 9
layer 7
layered 7
layout 12
lazy 21
lda 5
learn 16
learned 16
learner 10
learners 12
learning 1249
least 17
length 27
less 8
lessons 12
level 90
levels 7
leveraging 14
lexical 18
lexicon 6
libraries 17
library 10
life 17
lifecycle 5
light 16
lightweight 17
like 17
likelihood 17
limitations 8
limited 17
limits 8
line 49
lineage 6
linear 138
lingual 12
linguistic 14
link 75
linkage 20
linked 5
linking 12
links 23
list 9
lists 15
lite 7
literature 11
live 6
load 39
local 156
locality 17
localization 27
localized 9
locally 13
locating 8
location 48
locations 5
locking 6
log 27
logic 146
logical 37
logics 28
logistic 23
logs 34
long 31
look 13
lookahead 6
loop 9
loosely 7
loss 18
low 44
lower 16
lsi 6
machine 117
machines 95
made 6
main 11
maintaining 23
maintenance 57
make 18
making 53
management 220
manager 9
managing 41
manifold 34
manifolds 12
manipulating 4
manipulation 11
manufacturing 5
many 19
map 37
mapping 70
mappings 36
maps 28
margin 44
market 20
marketing 18
markets 6
markov 140
markovian 8
mashup 5
mashups 7
mass 10
massive 41
match 20
matching 163
matchmaking 7
materialized 26
mathematical 8
matrices 20
matrix 57
matter 5
max 26
maximal 33
maximally 5
maximization 20
maximizing 14
maximum 54
mcmc 7
mdl 6
mdp 5
mdps 21
mean 7
meaning 9
meaningful 10
means 36
measure 41
measurement 10
measures 74
measuring 33
mechanism 28
mechanisms 13
media 25
mediated 5
mediation 9
mediator 7
medical 33
meets 12
melody 5
membership 6
memory 75
mental 5
merge 12
merging 32
mesh 6
message 17
messages 6
meta 37
metadata 22
metasearch 14
method 208
methodology 11
methods 143
metric 56
metrics 25
microarray 22
microsoft 17
mid 5
middle 9
middleware 16
migration 7
min 5
mine 9
miner 10
minimal 36
minimax 5
minimization 24
minimizing 11
minimum 18
mining 1004
minority 6
missing 16
mixed 23
mixture 62
mixtures 19
mobile 132
modal 28
mode 9
model 494
modeling 186
modelling 24
models 446
modern 7
modified 12
modular 15
modules 6
molecular 9
monitoring 80
monocular 5
monotone 8
monotonic 7
monte 17
more 37
morphological 5
most 18
motifs 13
motion 55
motions 5
movement 8
moving 61
mpeg 7
mrf 5
mrfs 5
multi 409
multiagent 29
multiclass 20
multidimensional 36
multilevel 7
multilingual 21
multimedia 49
multimodal 20
multinomial 11
multiobjective 6
multiple 215
multiplicative 5
multirelational 5
multiresolution 5
multiscale 10
multivariate 13
music 52
musical 6
mutual 22
naive 38
name 15
named 31
names 7
narrative 5
nash 10
native 12
natural 52
navigating 6
navigation 30
navigational 5
near 27
nearest 85
necessary 5
need 6
needs 10
negation 7
negative 31
negotiation 21
neighbor 71
neighborhood 29
neighbors 14
nested 18
net 13
nets 7
network 239
networked 11
networking 9
networks 317
neural 54
neuroevolution 6
new 187
news 54
newton 6
next 21
nmf 5
node 9
nodes 6
noise 33
noisy 36
nominal 5
non 139
nondeterministic 6
nonlinear 38
nonnegative 13
nonparametric 13
nonrigid 5
norm 6
normal 10
normalization 13
normalized 7
not 26
notification 5
notion 6
noun 5
novel 69
novelty 18
number 16
numbers 7
numeric 9
numerical 17
object 126
objective 24
objects 114
observable 16
observation 14
observations 17
observed 7
obstacles 5
occlusion 6
occurrence 10
off 12
offline 5
olap 42
oltp 5
one 69
online 191
only 21
ontological 8
ontologies 50
ontology 75
open 39
operating 5
operation 6
operational 6
operations 21
operator 23
operators 16
opinion 22
opinions 6
opportunities 12
optimal 146
optimally 5
optimisation 6
optimistic 6
optimization 196
optimizations 5
optimize 6
optimized 20
optimizer 9
optimizing 64
options 6
oracle 35
order 96
ordered 28
ordering 35
orders 11
ordinal 10
organization 7
organizing 31
orientation 8
oriented 74
orthogonal 17
other 12
out 21
outbreak 5
outdoor 5
outlier 42
outliers 22
output 20
outputs 5
outsourced 9
over 241
overlap 5
overlapping 16
overlay 16
overview 8
owl 14
pac 6
page 71
pagerank 37
pages 52
pair 7
pairs 17
pairwise 23
panel 11
paper 6
paradigm 11
parallel 75
parameter 34
parameterized 8
parameters 13
parametric 22
pareto 5
parsimonious 5
parsing 20
part 16
partial 64
partially 46
particle 21
partition 10
partitioned 13
partitioning 48
partitions 5
parts 12
party 9
pass 12
passage 15
passing 5
passive 6
past 12
patches 5
patent 5
path 55
paths 13
patient 9
pattern 195
patterns 270
pca 17
peculiarity 5
peer 193
people 23
perception 11
perceptron 9
perceptual 11
perfect 5
performance 179
performing 5
periodic 12
periodicity 6
permutation 10
person 14
personal 44
personalization 28
personalized 62
personalizing 7
perspective 30
perturbation 5
pervasive 9
phase 29
phishing 4
phrase 20
phrases 7
physical 29
physics 6
picture 6
piecewise 9
pipelined 6
pixel 5
placement 14
plan 25
planar 8
plane 5
planner 8
planning 154
plans 34
platform 44
play 10
player 10
playing 11
point 37
points 18
poisson 6
poker 9
policies 25
policy 41
polynomial 23
pomdps 34
popularity 6
population 11
portal 10
portals 9
pose 11
position 8
positive 27
possibilistic 12
possible 7
post 6
posterior 5
potential 14
power 31
powered 5
practical 40
practice 19
pre 20
precision 33
predicate 8
predicates 23
predict 13
predicting 54
prediction 105
predictions 5
predictive 56
preference 35
preferences 50
prefetching 11
prefix 7
preprocessing 8
presence 41
present 5
presentation 5
preservation 20
preserving 108
price 9
primitive 5
principal 23
principle 10
principled 6
principles 11
prior 16
prioritized 5
priors 18
privacy 152
private 19
proactive 16
probabilistic 246
probabilities 16
probability 48
probe 5
probing 5
problem 97
problems 106
procedural 7
procedure 8
process 79
processes 70
processing 288
processor 20
processors 12
producing 5
product 28
production 10
profile 22
profiles 22
profiling 20
profit 8
program 13
programming 121
programs 49
progress 16
progressive 31
project 19
projected 12
projection 34
projections 23
projector 8
proof 12
proofs 5
propagating 6
propagation 43
properties 30
proportional 5
propositional 23
protecting 12
protection 10
protein 47
proteins 6
protocol 24
protocols 11
prototype 18
prototyping 6
provenance 10
providers 7
providing 21
proving 6
provisioning 7
proximity 31
proxy 12
pruning 47
pseudo 25
public 14
publication 7
publish 21
publishing 26
pull 5
purchase 5
pure 6
pursuit 5
push 5
pushing 14
pyramid 6
qos 8
quadratic 5
qualitative 31
quality 79
quantification 5
quantified 15
quantifying 9
quantile 6
quantiles 7
quantitative 21
quasi 13
queries 483
query 675
querying 126
question 75
questions 16
random 109
randomization 9
randomized 22
range 35
rank 61
ranked 22
ranking 181
rankings 11
rapid 14
rare 20
rate 16
rates 7
rating 8
ratings 6
ratio 9
rational 6
rdbms 15
rdf 36
reachability 8
reactive 9
reading 15
real 116
realistic 6
reality 8
reasoning 134
recall 11
recent 9
recognition 159
recognizing 12
recommendation 47
recommendations 18
recommender 27
reconciliation 5
reconciling 6
reconstruction 25
record 27
records 21
recovery 21
recurrent 9
recursive 15
recycling 6
reduce 7
reduced 5
reducing 20
reduction 102
redundancy 20
redundant 13
reference 18
refinement 31
refining 13
reformulation 6
region 26
regions 23
registration 14
regression 129
regret 8
regular 16
regularization 29
regularized 19
regulatory 8
reinforcement 145
related 14
relatedness 8
relation 27
relational 242
relations 47
relationship 36
relationships 30
relative 17
relaxation 11
relaxations 5
relaxed 10
release 5
relevance 142
relevant 39
reliability 6
reliable 14
relief 7
remote 17
removal 7
reordering 6
repairing 7
replacement 6
replica 5
replicated 6
replication 21
report 11
reporting 6
reports 6
repositories 13
repository 10
representation 94
representations 55
representative 11
represented 6
representing 25
reputation 8
requirements 9
rescue 5
research 43
residual 5
resilient 5
resolution 50
resolving 7
resource 50
resources 29
response 18
restoration 8
restricted 9
restrictions 5
result 27
results 104
retrieval 563
retrieving 9
reuse 8
reverse 22
review 8
reviews 8
revision 20
revisited 19
revisiting 8
revolution 5
reward 11
rewards 5
rewrite 5
rewriting 27
rfid 17
right 15
rights 6
risk 21
road 15
robot 74
robotic 8
robotics 6
robots 36
robust 140
robustness 20
roc 21
role 29
roles 6
rotation 7
rough 21
route 5
routing 35
row 5
rss 11
rule 128
rules 190
run 8
running 5
runtime 9
safe 6
safety 10
sales 6
salient 8
sample 31
samples 13
sampling 105
sap 5
sat 32
satisfaction 31
satisfiability 26
scalability 10
scalable 130
scale 141
scaling 39
scan 11
scans 6
scenarios 5
scene 14
scenes 10
scheduling 41
schema 99
schemas 32
scheme 46
schemes 21
science 20
sciences 5
scientific 44
score 18
scores 10
scoring 21
search 768
searches 10
searching 85
second 8
secondary 6
secure 28
security 36
seeking 12
segmentation 102
segmenting 8
segments 11
select 7
selecting 23
selection 273
selections 5
selective 18
selectivity 24
self 96
selling 5
semantic 338
semantically 6
semantics 65
semi 146
semistructured 17
sense 36
senses 5
sensing 18
sensitive 81
sensitivity 13
sensor 92
sensors 7
sensory 5
sentence 21
sentences 12
sentiment 14
separation 7
sequence 68
sequences 86
sequencing 6
sequential 102
series 161
server 45
servers 17
service 99
services 148
session 11
sessions 9
set 107
sets 130
settings 11
several 6
shape 47
shapes 11
shaping 6
shared 29
sharing 51
shedding 19
shift 9
shopping 5
short 16
side 10
signal 9
signals 9
signature 12
signatures 9
significance 9
significant 15
similar 30
similarities 9
similarity 206
simple 56
simplified 6
simulated 6
simulation 22
simultaneous 35
single 44
site 26
sites 39
situation 13
size 34
sizes 6
sketch 17
sketches 9
sketching 6
skewed 9
skill 12
sky 5
skyline 35
skylines 8
slam 5
sliding 24
small 22
smart 13
smooth 8
smoothing 22
snapshot 12
snippet 5
snippets 8
soccer 6
social 116
soft 22
software 35
solution 35
solutions 33
solve 7
solver 10
solving 66
some 17
sorting 10
source 34
sources 59
space 142
spacecraft 7
spaces 55
spam 38
spanning 5
sparse 57
spatial 153
spatially 6
spatio 52
spatiotemporal 11
specific 52
specification 18
specifications 6
specified 6
spectra 6
spectral 53
spectrum 8
speech 33
speed 20
speeding 12
split 7
splitting 12
spoken 13
sponsored 6
spontaneous 5
sql 77
squares 11
stability 11
stable 18
stacking 6
stage 10
standard 8
standards 5
star 13
stars 5
start 5
state 94
states 12
static 24
stationary 7
statistic 5
statistical 102
statistically 5
statistics 36
stemming 8
step 18
steps 5
stereo 23
stochastic 50
stock 10
stopping 5
storage 54
store 6
stores 6
story 11
strategic 7
strategies 56
strategy 38
stratified 7
stream 132
streaming 62
streams 267
strength 7
string 39
strings 6
strong 14
strongly 6
structural 79
structure 205
structured 159
structures 65
structuring 10
student 5
studies 9
study 144
style 15
sub 13
subgraph 10
subgraphs 16
subgroup 11
subject 5
subjective 6
subjectivity 5
subqueries 5
subscribe 21
subscription 6
subsequence 24
subsequences 6
subset 17
subsets 9
subspace 63
subspaces 11
substring 5
substructure 10
substructures 6
subtrees 5
succinct 7
sufficient 5
suffix 13
suggestion 10
suite 9
sum 20
summaries 25
summarisation 7
summarization 93
summarizing 16
summary 17
super 13
superimposed 5
supervised 162
supervision 6
support 228
supported 6
supporting 62
surface 19
surfaces 8
surveillance 25
survey 6
svm 45
svms 24
swarm 6
switching 6
symbolic 23
symmetric 11
symmetries 5
symmetry 10
synchronization 8
synopses 26
synopsis 6
syntactic 21
syntax 7
synthesis 8
synthetic 6
system 412
systematic 12
systems 353
table 22
tables 27
tabular 5
tag 23
tagging 13
tags 6
taking 10
tale 5
taming 6
target 16
targeted 7
targeting 6
task 68
tasks 33
taxonomies 17
taxonomy 14
teaching 5
team 11
teams 6
technique 47
techniques 115
technologies 18
technology 36
telecom 5
template 20
templates 5
temporal 230
temporally 8
tensor 22
terabyte 5
term 98
terminological 7
terms 21
test 55
testbed 5
testing 31
tests 9
text 444
texts 21
textual 23
texture 10
than 18
that 34
the 2016
their 38
thematic 6
theorem 7
theoretic 49
theoretical 18
theories 17
theory 58
there 7
thesaurus 6
they 6
thin 6
third 7
three 14
threshold 17
thresholding 5
through 175
tier 11
tight 7
time 411
times 5
title 5
tolerance 7
tolerant 14
too 5
tool 67
toolkit 9
tools 16
top 94
topic 112
topical 15
topics 24
topological 16
topology 12
topss 5
toward 28
towards 166
trace 6
tracing 8
tracking 118
tractability 8
tractable 21
trade 8
tradeoffs 6
trading 15
traditional 5
traffic 35
trained 7
training 79
trajectories 14
trajectory 16
transaction 32
transactional 17
transactions 12
transcripts 5
transduction 6
transductive 18
transfer 42
transferring 7
transform 12
transformation 24
transformations 17
transition 11
transitions 12
translating 7
translation 54
transliteration 6
transparent 8
transport 8
transportation 8
travel 9
trec 10
tree 233
trees 157
treewidth 7
trend 11
trends 17
trust 29
tuning 40
turning 6
tutorial 7
tutoring 6
twig 19
two 71
type 32
types 13
ubiquitous 7
unbiased 5
uncertain 43
uncertainty 39
uncooperative 5
under 82
understanding 39
unexpected 6
unified 42
uniform 12
unifying 14
unit 11
units 5
universal 12
unknown 13
unlabeled 31
unordered 7
unstructured 26
unsupervised 82
untrusted 5
update 33
updates 35
updating 14
upper 5
urban 7
urls 8
usability 6
usage 19
use 49
used 5
useful 15
user 207
users 37
using 1271
utility 52
utilizing 15
vague 7
validating 7
validation 23
validity 7
value 92
valued 17
values 30
variable 38
variables 27
variance 16
variants 6
variation 8
variational 15
various 8
varying 8
vector 150
vectors 10
vehicle 15
vehicles 5
verification 27
verifying 6
versatile 6
version 11
versions 5
versus 23
vertical 12
vertically 6
very 40
via 235
video 103
videos 12
view 87
viewing 5
viewpoint 7
views 87
virtual 39
visibility 5
visible 5
vision 25
visual 121
visualization 63
visualizing 24
visually 9
vocabulary 11
volume 5
voting 22
walk 20
walking 5
walks 10
warehouse 25
warehouses 17
warehousing 15
warping 16
wavelet 16
wavelets 7
way 27
weak 16
weakly 6
web 1141
weblog 5
webpage 6
website 14
websites 6
weight 16
weighted 68
weighting 35
weights 11
well 7
what 42
when 39
where 6
while 8
who 9
why 24
wide 33
wikipedia 30
wild 7
window 28
windows 21
wireless 39
wise 8
with 1332
within 20
without 52
word 58
wordnet 5
words 29
work 9
workflow 15
workflows 14
working 5
workload 12
workloads 10
workshop 15
world 61
worlds 7
worst 5
wrapper 12
www 10
xml 552
xpath 61
xquery 57
xslt 6
yahoo 7
years 6
yet 6
you 24
your 25
zero 12
