1,abduction,8
2,abductive,6
3,abnormal,5
4,abnormality,6
5,about,48
6,abstract,40
7,abstraction,23
8,abstractions,7
9,academic,9
10,accelerated,7
11,accelerating,8
12,acceleration,10
13,access,112
14,accesses,6
15,accessibility,8
16,accuracy,42
17,accurate,38
18,accurately,6
19,achieving,10
20,acoustic,6
21,acquiring,7
22,acquisition,44
23,across,26
24,action,69
25,actionable,7
26,actions,27
27,active,123
28,activities,17
29,activity,32
30,adaboost,7
31,adaptable,8
32,adaptation,35
33,adapting,19
34,adaptive,212
35,adaptively,5
36,adding,13
37,additive,12
38,addressing,6
39,advanced,20
40,adversarial,6
41,advertising,19
42,advice,10
43,advisor,6
44,affective,6
45,against,18
46,agent,105
47,agents,70
48,agglomerative,6
49,aggregate,39
50,aggregates,23
51,aggregating,7
52,aggregation,75
53,agreement,6
54,ahead,5
55,aided,10
56,air,7
57,algebra,18
58,algebraic,18
59,algorithm,393
60,algorithmic,9
61,algorithms,265
62,alignment,27
63,all,15
64,allocation,30
65,almost,9
66,alpha,7
67,alternating,6
68,alternative,15
69,ambiguity,8
70,ambiguous,10
71,among,24
72,analogical,6
73,analogy,12
74,analyses,4
75,analysis,459
76,analytical,10
77,analytics,8
78,analyzer,5
79,analyzing,36
80,anatomy,8
81,anchor,9
82,and,2813
83,annotated,6
84,annotating,5
85,annotation,52
86,annotations,18
87,anomalies,9
88,anomaly,27
89,anonymity,19
90,anonymization,15
91,anonymized,5
92,anonymizing,5
93,anonymous,13
94,another,7
95,answer,46
96,answering,109
97,answers,24
98,anti,7
99,any,6
100,anytime,22
101,appearance,12
102,application,174
103,applications,180
104,applied,15
105,applying,26
106,approach,550
107,approaches,47
108,approximate,131
109,approximately,5
110,approximating,19
111,approximation,75
112,approximations,10
113,aqualogic,6
114,arabic,10
115,arbitrarily,5
116,arbitrary,21
117,arc,11
118,architecture,73
119,architectures,23
120,archives,14
121,are,38
122,area,17
123,argument,7
124,argumentation,14
125,arithmetic,6
126,armed,5
127,array,7
128,art,13
129,articles,6
130,artificial,22
131,aspect,11
132,aspects,12
133,assessing,9
134,assessment,23
135,assignment,13
136,assistant,8
137,assisted,6
138,associated,7
139,association,162
140,associations,31
141,associative,19
142,assumption,6
143,assurance,6
144,asymmetric,12
145,asynchronous,7
146,attack,7
147,attacks,20
148,attention,5
149,attribute,38
150,attributes,47
151,auc,6
152,auction,16
153,auctions,32
154,audio,14
155,auditing,6
156,augmented,12
157,augmenting,6
158,authentication,6
159,author,8
160,authority,12
161,authorship,5
162,auto,5
163,automata,22
164,automated,73
165,automatic,214
166,automatically,31
167,automating,16
168,automation,6
169,autonomic,8
170,autonomous,47
171,auxiliary,5
172,availability,5
173,available,9
174,average,21
175,averaged,5
176,averaging,7
177,avoiding,5
178,aware,68
179,awareness,12
180,axiomatic,8
181,axis,5
182,back,15
183,background,15
184,backtracking,5
185,bad,6
186,bag,8
187,bagging,17
188,balanced,16
189,balancing,15
190,bandit,9
191,bandwidth,8
192,bargaining,5
193,base,19
194,based,1480
195,baseline,5
196,bases,21
197,basic,10
198,basis,16
199,basket,6
200,batch,22
201,bayes,63
202,bayesian,194
203,behavior,73
204,behaviors,10
205,behaviour,10
206,belief,57
207,beliefs,9
208,benchmark,16
209,benchmarking,7
210,benefits,8
211,bernoulli,6
212,best,36
213,better,37
214,between,93
215,beyond,37
216,bias,25
217,biased,26
218,bid,6
219,bidding,8
220,bilingual,9
221,binary,33
222,bio,6
223,bioinformatics,7
224,biological,30
225,biology,6
226,biomedical,23
227,biometric,6
228,bipartite,17
229,bit,9
230,bitmap,11
231,blind,14
232,block,16
233,blocking,9
234,blocks,9
235,blog,14
236,blogosphere,7
237,blogs,11
238,body,7
239,book,6
240,books,6
241,boolean,22
242,boosted,6
243,boosting,102
244,bootstrap,7
245,bootstrapping,11
246,border,6
247,both,18
248,bottom,16
249,bound,20
250,boundary,20
251,bounded,29
252,bounding,5
253,bounds,36
254,box,8
255,bpel,5
256,brain,14
257,branch,5
258,branching,9
259,breadth,5
260,breaking,12
261,bregman,7
262,bridging,17
263,bringing,8
264,broadcast,20
265,browser,18
266,browsing,49
267,buffer,8
268,build,5
269,building,73
270,bulk,9
271,bursty,6
272,business,59
273,but,6
274,cache,35
275,caching,58
276,calculation,5
277,calculus,16
278,calibration,15
279,call,9
280,camera,18
281,cameras,8
282,can,21
283,cancer,8
284,canonical,5
285,capture,10
286,capturing,20
287,cardinality,18
288,care,5
289,carlo,17
290,cascade,7
291,cascaded,5
292,case,105
293,catalog,7
294,catalogs,5
295,categorical,31
296,categories,18
297,categorisation,7
298,categorization,92
299,categorizing,7
300,category,16
301,causal,36
302,causality,5
303,cell,8
304,cellular,6
305,center,12
306,centered,11
307,centers,5
308,centric,24
309,centroid,7
310,chain,17
311,chaining,6
312,chains,10
313,challenge,16
314,challenges,48
315,change,49
316,changes,22
317,changing,15
318,channel,10
319,channels,6
320,character,6
321,characteristic,6
322,characteristics,6
323,characterization,19
324,characterizations,6
325,characterizing,10
326,characters,5
327,check,5
328,checking,26
329,chemical,11
330,chinese,33
331,chip,5
332,choice,7
333,choosing,5
334,citation,10
335,citations,5
336,class,104
337,classes,27
338,classical,6
339,classification,545
340,classifier,78
341,classifiers,126
342,classify,9
343,classifying,29
344,clause,8
345,cleaning,21
346,cleansing,5
347,click,24
348,clicks,6
349,clickthrough,11
350,client,16
351,clients,6
352,clinical,11
353,clio,5
354,clique,7
355,cliques,6
356,clir,7
357,closed,62
358,clouds,7
359,cluster,101
360,clustered,12
361,clustering,658
362,clusterings,10
363,clusters,65
364,coalition,12
365,coalitional,7
366,code,13
367,coded,5
368,codes,6
369,coding,8
370,cognitive,28
371,coherence,6
372,coherent,9
373,collaboration,12
374,collaborative,122
375,collection,47
376,collections,59
377,collective,17
378,color,18
379,column,13
380,com,5
381,combination,28
382,combinations,5
383,combinatorial,28
384,combine,8
385,combined,10
386,combining,118
387,commerce,25
388,commercial,6
389,commodity,7
390,common,19
391,communication,29
392,communities,33
393,community,51
394,compact,27
395,comparative,31
396,comparing,35
397,comparison,65
398,comparisons,18
399,competitive,12
400,compilation,16
401,compiling,10
402,complete,28
403,completeness,6
404,completion,7
405,complex,99
406,complexity,84
407,component,40
408,components,15
409,composing,5
410,composite,14
411,composition,35
412,compositional,8
413,compound,10
414,comprehensive,7
415,compressed,24
416,compressing,9
417,compression,40
418,computation,83
419,computational,40
420,computations,5
421,computer,51
422,computing,81
423,concept,75
424,concepts,31
425,conceptual,23
426,concise,7
427,concurrency,9
428,concurrent,24
429,condensed,6
430,condition,5
431,conditional,70
432,conditions,14
433,confidence,19
434,configurable,6
435,configuration,15
436,conflict,11
437,conformant,6
438,conjunctive,20
439,connected,19
440,connecting,8
441,connections,8
442,connectivity,9
443,conquer,6
444,conscious,13
445,consensus,11
446,considerations,5
447,considering,5
448,consistency,60
449,consistent,20
450,constant,10
451,constrained,65
452,constraint,135
453,constraints,145
454,construct,5
455,constructing,26
456,construction,68
457,consumer,7
458,containing,5
459,containment,19
460,content,166
461,contents,9
462,context,103
463,contexts,8
464,contextual,31
465,contingency,5
466,continuous,129
467,contours,5
468,contract,9
469,contrast,7
470,control,90
471,controlled,13
472,controlling,5
473,convergence,15
474,conversation,6
475,conversational,9
476,conversations,5
477,convex,19
478,convolution,6
479,cooperation,6
480,cooperative,32
481,coordinate,6
482,coordinated,5
483,coordination,31
484,core,25
485,corpora,22
486,corpus,24
487,correcting,7
488,correction,11
489,correctness,7
490,correlated,25
491,correlation,63
492,correlations,11
493,correspondence,13
494,correspondences,7
495,cost,88
496,costs,11
497,count,7
498,counting,27
499,counts,7
500,coupled,10
501,coupling,9
502,covariance,7
503,coverage,15
504,covering,14
505,crawl,5
506,crawler,9
507,crawling,25
508,create,6
509,creating,15
510,creation,13
511,criteria,23
512,criterion,16
513,critical,5
514,cross,91
515,crowd,6
516,csp,16
517,csps,13
518,cube,21
519,cubes,27
520,cubing,5
521,cues,7
522,currency,6
523,current,5
524,curse,5
525,curve,7
526,curves,16
527,customer,34
528,customers,7
529,cut,12
530,cuts,5
531,cyclic,5
532,data,1926
533,database,322
534,databases,353
535,datalog,10
536,dataset,6
537,datasets,67
538,dbms,24
539,dealing,8
540,debugging,10
541,decentralized,17
542,decidability,5
543,decision,177
544,decisions,7
545,declarative,24
546,declustering,5
547,decomposition,45
548,decompositions,11
549,decoupled,6
550,deduplication,6
551,deep,23
552,default,8
553,defined,9
554,definition,8
555,definitional,6
556,definitions,7
557,deformable,10
558,degree,7
559,delay,8
560,delayed,5
561,deletion,8
562,delivery,17
563,delta,6
564,demand,22
565,demonstration,18
566,dense,19
567,density,64
568,dependence,12
569,dependencies,44
570,dependency,32
571,dependent,28
572,deployment,6
573,depth,17
574,deriving,15
575,descent,7
576,describing,5
577,description,44
578,descriptions,24
579,descriptors,10
580,design,111
581,designing,18
582,desktop,8
583,detect,15
584,detecting,83
585,detection,318
586,detector,5
587,determination,9
588,determining,14
589,deterministic,17
590,developers,5
591,developing,13
592,development,30
593,device,7
594,devices,24
595,diagnosability,6
596,diagnosing,4
597,diagnosis,33
598,diagnostic,6
599,diagrams,12
600,dialog,6
601,dialogue,7
602,dictionaries,6
603,dictionary,6
604,difference,21
605,differences,5
606,different,37
607,differential,9
608,difficult,6
609,difficulty,7
610,diffusion,13
611,digital,39
612,dimension,32
613,dimensional,169
614,dimensionality,60
615,dimensions,12
616,direct,32
617,directed,30
618,directions,8
619,directories,13
620,directory,5
621,dirichlet,27
622,disambiguation,37
623,disclosure,6
624,discourse,6
625,discover,7
626,discovering,104
627,discovery,224
628,discrete,32
629,discretization,17
630,discriminant,51
631,discriminating,7
632,discrimination,6
633,discriminative,57
634,discussion,5
635,disease,10
636,disjunction,5
637,disjunctive,13
638,disk,17
639,disparate,5
640,disparity,6
641,display,5
642,displays,5
643,dissemination,22
644,dissimilarity,11
645,distance,94
646,distances,9
647,distillation,7
648,distinct,5
649,distinguishing,8
650,distributed,268
651,distribution,53
652,distributional,6
653,distributions,39
654,divergence,8
655,diverse,17
656,diversity,18
657,divide,12
658,dna,5
659,document,273
660,documents,218
661,does,13
662,domain,123
663,domains,61
664,dominance,9
665,dominant,7
666,don,5
667,down,20
668,dream,5
669,drift,7
670,drifting,8
671,driven,96
672,drug,7
673,dtds,5
674,dual,20
675,duality,7
676,duplicate,27
677,duplicates,9
678,during,10
679,dynamic,247
680,dynamical,11
681,dynamically,13
682,dynamics,25
683,early,15
684,earth,9
685,easy,9
686,economic,6
687,edge,16
688,edges,5
689,edit,5
690,editing,6
691,education,7
692,effect,14
693,effective,118
694,effectively,5
695,effectiveness,30
696,effects,26
697,efficiency,24
698,efficient,662
699,efficiently,51
700,effort,10
701,elastic,5
702,electronic,23
703,element,9
704,elements,6
705,elicitation,13
706,eliminating,8
707,elimination,11
708,email,34
709,emails,6
710,embedded,17
711,embedding,28
712,embeddings,6
713,emergence,6
714,emerging,23
715,emotions,6
716,empirical,43
717,enabled,12
718,enabling,28
719,encoded,6
720,encoding,16
721,encodings,5
722,end,13
723,energy,19
724,engine,128
725,engineering,37
726,engines,46
727,english,13
728,enhance,13
729,enhanced,37
730,enhancing,27
731,enough,10
732,ensemble,59
733,ensembles,42
734,entailment,7
735,enterprise,30
736,entities,22
737,entity,46
738,entropy,38
739,enumeration,5
740,environment,72
741,environments,73
742,episodes,12
743,epistemic,9
744,equation,5
745,equations,5
746,equilibria,11
747,equilibrium,10
748,equivalence,22
749,error,65
750,errors,8
751,estimate,8
752,estimates,13
753,estimating,51
754,estimation,159
755,estimator,7
756,estimators,12
757,euclidean,10
758,evaluating,87
759,evaluation,249
760,evaluations,5
761,event,95
762,events,33
763,evidence,32
764,evolution,49
765,evolutionary,45
766,evolving,42
767,exact,19
768,examining,5
769,example,26
770,examples,29
771,exceptions,5
772,exchange,25
773,executing,5
774,execution,42
775,existing,5
776,expansion,56
777,expectation,21
778,expectations,8
779,expected,14
780,expensive,8
781,experience,24
782,experiences,9
783,experiment,11
784,experimental,36
785,experimenting,5
786,experiments,31
787,expert,30
788,expertise,15
789,experts,17
790,explaining,9
791,explanation,13
792,explanations,12
793,explicit,15
794,exploit,5
795,exploitation,6
796,exploiting,93
797,exploration,58
798,exploratory,12
799,exploring,51
800,exponential,11
801,expression,52
802,expressions,29
803,expressive,28
804,expressiveness,5
805,extended,29
806,extending,30
807,extensible,13
808,extension,22
809,extensions,13
810,external,19
811,extract,6
812,extracting,64
813,extraction,213
814,extreme,9
815,extremely,6
816,eye,9
817,face,41
818,faceted,8
819,facial,9
820,facilitating,5
821,fact,8
822,factor,15
823,factored,14
824,factorization,33
825,factors,12
826,facts,6
827,failure,12
828,failures,8
829,false,12
830,family,13
831,fast,220
832,faster,13
833,fault,16
834,feasibility,7
835,feature,237
836,features,99
837,federated,19
838,feedback,117
839,few,13
840,field,21
841,fields,42
842,file,17
843,files,12
844,filter,22
845,filtering,147
846,filters,21
847,financial,7
848,find,12
849,finding,155
850,fine,14
851,fingerprint,5
852,finite,20
853,first,68
854,fisher,14
855,fitting,5
856,fixed,6
857,flash,5
858,flexible,59
859,flow,26
860,fly,11
861,focal,5
862,focused,25
863,for,4865
864,forecasting,11
865,forest,6
866,form,23
867,formal,21
868,formalization,5
869,formation,12
870,forms,6
871,formulae,5
872,formulas,16
873,formulation,13
874,forward,12
875,foundation,7
876,foundations,14
877,fourier,5
878,fractal,6
879,fragment,7
880,fragments,13
881,framework,273
882,fraud,7
883,free,43
884,frequency,25
885,frequent,208
886,freshness,5
887,friendly,6
888,from,717
889,frontier,6
890,full,28
891,fully,11
892,function,64
893,functional,31
894,functions,98
895,fusion,52
896,future,18
897,fuzzy,53
898,gain,7
899,gait,5
900,game,37
901,games,72
902,gap,19
903,gathering,6
904,gaussian,49
905,gene,53
906,general,68
907,generalization,24
908,generalized,79
909,generalizing,9
910,generated,13
911,generating,61
912,generation,112
913,generative,32
914,generator,9
915,generators,10
916,generic,34
917,genes,7
918,genetic,39
919,genome,8
920,genomic,11
921,genomics,7
922,genre,10
923,geo,5
924,geodesic,5
925,geographic,14
926,geographical,5
927,geometric,28
928,geometry,16
929,geospatial,6
930,gesture,5
931,get,5
932,getting,7
933,given,6
934,global,48
935,goal,21
936,goals,15
937,golog,6
938,good,33
939,google,13
940,government,7
941,gradient,32
942,grained,18
943,gram,6
944,grammar,10
945,grammars,10
946,grammatical,8
947,grams,7
948,grand,7
949,granularity,8
950,graph,217
951,graphical,43
952,graphics,14
953,graphs,124
954,greedy,14
955,grid,29
956,ground,6
957,grounding,8
958,group,31
959,grouping,18
960,groups,12
961,growing,5
962,growth,10
963,guarantees,18
964,guidance,5
965,guided,25
966,handling,34
967,hard,17
968,hardness,7
969,hardware,10
970,hash,11
971,hashing,6
972,head,5
973,health,7
974,help,12
975,heterogeneous,62
976,heuristic,44
977,heuristics,24
978,hidden,74
979,hiding,8
980,hierarchical,202
981,hierarchically,10
982,hierarchies,30
983,hierarchy,23
984,high,227
985,higher,15
986,highly,39
987,histogram,14
988,histograms,19
989,historical,20
990,history,19
991,hits,9
992,hmm,6
993,hoc,29
994,holistic,13
995,home,6
996,horizon,6
997,horn,5
998,hot,7
999,how,51
1000,html,14
1001,human,93
1002,humans,6
1003,hybrid,79
1004,hyper,5
1005,hypergraph,8
1006,hyperlinks,7
1007,hypermedia,9
1008,hypertext,12
1009,hypertree,6
1010,hypotheses,7
1011,hypothesis,8
1012,ibm,8
1013,ica,5
1014,iceberg,9
1015,identification,74
1016,identify,11
1017,identifying,47
1018,identity,7
1019,illumination,7
1020,image,199
1021,imagery,6
1022,images,67
1023,imaging,7
1024,imbalance,6
1025,imbalanced,19
1026,imitation,8
1027,impact,34
1028,imperfect,11
1029,implementation,38
1030,implementations,6
1031,implementing,11
1032,implication,5
1033,implications,13
1034,implicit,35
1035,importance,19
1036,important,6
1037,imprecise,13
1038,improve,59
1039,improved,42
1040,improvement,10
1041,improvements,5
1042,improves,6
1043,improving,140
1044,inclusion,7
1045,incomplete,51
1046,inconsistency,7
1047,inconsistent,11
1048,incorporating,36
1049,increasing,8
1050,incremental,105
1051,independence,15
1052,independent,46
1053,index,117
1054,indexed,9
1055,indexes,33
1056,indexing,194
1057,indices,15
1058,indirect,5
1059,individual,7
1060,individuals,6
1061,indoor,9
1062,induced,8
1063,inducing,9
1064,induction,48
1065,inductive,24
1066,industrial,9
1067,industry,10
1068,infer,6
1069,inference,107
1070,inferring,23
1071,infinite,10
1072,influence,25
1073,information,657
1074,informative,23
1075,infrared,5
1076,infrastructure,21
1077,initial,7
1078,initiative,6
1079,injection,5
1080,innovation,5
1081,input,10
1082,inputs,5
1083,inside,5
1084,inspired,7
1085,instance,55
1086,instances,17
1087,insurance,6
1088,integer,5
1089,integrated,44
1090,integrating,71
1091,integration,138
1092,integrity,6
1093,intelligence,40
1094,intelligent,54
1095,intensity,7
1096,intensive,12
1097,intent,9
1098,inter,19
1099,interacting,7
1100,interaction,59
1101,interactions,24
1102,interactive,118
1103,interest,18
1104,interesting,27
1105,interestingness,19
1106,interests,9
1107,interface,41
1108,interfaces,24
1109,internal,6
1110,internet,43
1111,interoperability,5
1112,interpretable,6
1113,interpretation,21
1114,interrelated,7
1115,intersection,8
1116,interval,13
1117,intervals,7
1118,into,73
1119,intra,5
1120,intranet,7
1121,intrinsic,6
1122,introduction,6
1123,intrusion,17
1124,invariant,17
1125,inverse,13
1126,inverted,17
1127,investigating,12
1128,investigation,13
1129,irrelevant,5
1130,isolation,11
1131,isometric,6
1132,issue,5
1133,issues,20
1134,item,29
1135,items,19
1136,itemset,38
1137,itemsets,56
1138,iterated,8
1139,iteration,26
1140,iterative,39
1141,its,84
1142,japanese,6
1143,join,69
1144,joining,6
1145,joins,51
1146,joint,32
1147,judgments,16
1148,just,12
1149,kdd,6
1150,kernel,151
1151,kernels,68
1152,key,19
1153,keyphrase,7
1154,keys,6
1155,keyword,58
1156,keywords,6
1157,knapsack,5
1158,knn,8
1159,know,6
1160,knowing,5
1161,knowledge,290
1162,known,11
1163,label,36
1164,labeled,37
1165,labeling,49
1166,labels,11
1167,lambda,6
1168,landmarks,7
1169,language,231
1170,languages,28
1171,laplacian,5
1172,large,339
1173,lasso,5
1174,latent,71
1175,lattice,14
1176,lattices,5
1177,law,8
1178,laws,9
1179,layer,7
1180,layered,7
1181,layout,12
1182,lazy,21
1183,lda,5
1184,learn,16
1185,learned,16
1186,learner,9
1187,learners,12
1188,learning,1226
1189,least,17
1190,length,27
1191,less,8
1192,lessons,12
1193,level,88
1194,levels,7
1195,leveraging,14
1196,lexical,18
1197,lexicon,6
1198,libraries,17
1199,library,10
1200,life,16
1201,lifecycle,5
1202,light,16
1203,lightweight,17
1204,like,16
1205,likelihood,17
1206,limitations,8
1207,limited,17
1208,limits,8
1209,line,49
1210,lineage,6
1211,linear,132
1212,lingual,12
1213,linguistic,14
1214,link,74
1215,linkage,19
1216,linked,5
1217,linking,12
1218,links,23
1219,list,9
1220,lists,15
1221,lite,7
1222,literature,11
1223,live,6
1224,load,39
1225,local,155
1226,locality,17
1227,localization,27
1228,localized,9
1229,locally,13
1230,locating,8
1231,location,48
1232,locations,5
1233,locking,6
1234,log,27
1235,logic,137
1236,logical,37
1237,logics,28
1238,logistic,23
1239,logs,34
1240,long,30
1241,look,13
1242,lookahead,6
1243,loop,9
1244,loosely,7
1245,loss,18
1246,low,44
1247,lower,16
1248,lsi,5
1249,machine,116
1250,machines,95
1251,made,6
1252,main,11
1253,maintaining,23
1254,maintenance,57
1255,make,17
1256,making,53
1257,management,219
1258,manager,9
1259,managing,41
1260,manifold,34
1261,manifolds,12
1262,manipulating,4
1263,manipulation,11
1264,manufacturing,5
1265,many,18
1266,map,37
1267,mapping,70
1268,mappings,36
1269,maps,28
1270,margin,44
1271,market,20
1272,marketing,18
1273,markets,6
1274,markov,140
1275,markovian,8
1276,mashup,5
1277,mashups,7
1278,mass,10
1279,massive,41
1280,match,19
1281,matching,161
1282,matchmaking,7
1283,materialized,26
1284,mathematical,8
1285,matrices,20
1286,matrix,57
1287,matter,5
1288,max,26
1289,maximal,32
1290,maximally,5
1291,maximization,20
1292,maximizing,14
1293,maximum,54
1294,mcmc,7
1295,mdl,6
1296,mdp,5
1297,mdps,21
1298,mean,7
1299,meaning,9
1300,meaningful,10
1301,means,36
1302,measure,41
1303,measurement,10
1304,measures,74
1305,measuring,33
1306,mechanism,28
1307,mechanisms,13
1308,media,25
1309,mediated,5
1310,mediation,9
1311,mediator,7
1312,medical,33
1313,meets,12
1314,melody,5
1315,membership,6
1316,memory,73
1317,mental,5
1318,merge,12
1319,merging,32
1320,mesh,5
1321,message,17
1322,messages,6
1323,meta,35
1324,metadata,22
1325,metasearch,14
1326,method,206
1327,methodology,11
1328,methods,142
1329,metric,55
1330,metrics,25
1331,microarray,22
1332,microsoft,17
1333,mid,5
1334,middle,9
1335,middleware,16
1336,migration,7
1337,min,5
1338,mine,8
1339,miner,10
1340,minimal,36
1341,minimax,5
1342,minimization,24
1343,minimizing,11
1344,minimum,18
1345,mining,993
1346,minority,6
1347,missing,16
1348,mixed,23
1349,mixture,61
1350,mixtures,18
1351,mobile,129
1352,modal,28
1353,mode,9
1354,model,485
1355,modeling,185
1356,modelling,24
1357,models,445
1358,modern,7
1359,modified,12
1360,modular,15
1361,modules,6
1362,molecular,9
1363,monitoring,80
1364,monocular,5
1365,monotone,7
1366,monotonic,7
1367,monte,17
1368,more,37
1369,morphological,5
1370,most,18
1371,motifs,13
1372,motion,54
1373,motions,5
1374,movement,8
1375,moving,56
1376,mpeg,7
1377,mrf,5
1378,mrfs,5
1379,multi,400
1380,multiagent,29
1381,multiclass,20
1382,multidimensional,36
1383,multilevel,7
1384,multilingual,21
1385,multimedia,49
1386,multimodal,20
1387,multinomial,11
1388,multiobjective,6
1389,multiple,215
1390,multiplicative,5
1391,multirelational,5
1392,multiresolution,5
1393,multiscale,10
1394,multivariate,13
1395,music,48
1396,musical,6
1397,mutual,22
1398,naive,38
1399,name,15
1400,named,30
1401,names,7
1402,narrative,5
1403,nash,10
1404,native,12
1405,natural,52
1406,navigating,6
1407,navigation,30
1408,navigational,5
1409,near,27
1410,nearest,85
1411,necessary,5
1412,need,6
1413,needs,10
1414,negation,7
1415,negative,31
1416,negotiation,21
1417,neighbor,71
1418,neighborhood,29
1419,neighbors,14
1420,nested,17
1421,net,13
1422,nets,7
1423,network,238
1424,networked,11
1425,networking,9
1426,networks,316
1427,neural,53
1428,neuroevolution,6
1429,new,186
1430,news,54
1431,newton,6
1432,next,21
1433,nmf,5
1434,node,9
1435,nodes,6
1436,noise,32
1437,noisy,36
1438,nominal,5
1439,non,138
1440,nondeterministic,6
1441,nonlinear,37
1442,nonnegative,13
1443,nonparametric,13
1444,nonrigid,5
1445,norm,6
1446,normal,10
1447,normalization,13
1448,normalized,7
1449,not,26
1450,notification,5
1451,notion,6
1452,noun,5
1453,novel,69
1454,novelty,18
1455,number,16
1456,numbers,7
1457,numeric,9
1458,numerical,17
1459,object,124
1460,objective,24
1461,objects,113
1462,observable,16
1463,observation,14
1464,observations,17
1465,observed,7
1466,obstacles,5
1467,occlusion,6
1468,occurrence,10
1469,off,12
1470,offline,5
1471,olap,42
1472,oltp,5
1473,one,66
1474,online,189
1475,only,21
1476,ontological,8
1477,ontologies,49
1478,ontology,73
1479,open,39
1480,operating,5
1481,operation,6
1482,operational,6
1483,operations,21
1484,operator,23
1485,operators,16
1486,opinion,22
1487,opinions,6
1488,opportunities,12
1489,optimal,146
1490,optimally,5
1491,optimisation,6
1492,optimistic,6
1493,optimization,195
1494,optimizations,5
1495,optimize,6
1496,optimized,20
1497,optimizer,9
1498,optimizing,64
1499,options,6
1500,oracle,35
1501,order,95
1502,ordered,28
1503,ordering,35
1504,orders,11
1505,ordinal,10
1506,organization,7
1507,organizing,31
1508,orientation,8
1509,oriented,74
1510,orthogonal,17
1511,other,12
1512,out,21
1513,outbreak,5
1514,outdoor,5
1515,outlier,41
1516,outliers,22
1517,output,20
1518,outputs,5
1519,outsourced,9
1520,over,241
1521,overlap,5
1522,overlapping,16
1523,overlay,16
1524,overview,8
1525,owl,12
1526,pac,6
1527,page,69
1528,pagerank,36
1529,pages,52
1530,pair,7
1531,pairs,17
1532,pairwise,23
1533,panel,11
1534,paper,6
1535,paradigm,11
1536,parallel,75
1537,parameter,34
1538,parameterized,8
1539,parameters,13
1540,parametric,22
1541,pareto,5
1542,parsimonious,5
1543,parsing,20
1544,part,15
1545,partial,64
1546,partially,46
1547,particle,21
1548,partition,10
1549,partitioned,13
1550,partitioning,48
1551,partitions,5
1552,parts,12
1553,party,9
1554,pass,12
1555,passage,15
1556,passing,5
1557,passive,6
1558,past,12
1559,patches,5
1560,patent,5
1561,path,54
1562,paths,13
1563,patient,9
1564,pattern,193
1565,patterns,266
1566,pca,15
1567,peculiarity,5
1568,peer,104
1569,people,23
1570,perception,11
1571,perceptron,9
1572,perceptual,10
1573,perfect,5
1574,performance,178
1575,performing,5
1576,periodic,12
1577,periodicity,6
1578,permutation,10
1579,person,13
1580,personal,43
1581,personalization,28
1582,personalized,62
1583,personalizing,7
1584,perspective,30
1585,perturbation,5
1586,pervasive,9
1587,phase,29
1588,phishing,4
1589,phrase,19
1590,phrases,7
1591,physical,29
1592,physics,6
1593,picture,6
1594,piecewise,9
1595,pipelined,6
1596,pixel,5
1597,placement,14
1598,plan,25
1599,planar,8
1600,plane,5
1601,planner,8
1602,planning,152
1603,plans,34
1604,platform,44
1605,play,10
1606,player,10
1607,playing,11
1608,point,36
1609,points,18
1610,poisson,6
1611,poker,9
1612,policies,25
1613,policy,40
1614,polynomial,23
1615,pomdps,32
1616,popularity,6
1617,population,11
1618,portal,10
1619,portals,9
1620,pose,11
1621,position,8
1622,positive,26
1623,possibilistic,12
1624,possible,7
1625,post,6
1626,posterior,5
1627,potential,14
1628,power,31
1629,powered,5
1630,practical,40
1631,practice,19
1632,pre,20
1633,precision,32
1634,predicate,8
1635,predicates,23
1636,predict,13
1637,predicting,54
1638,prediction,105
1639,predictions,5
1640,predictive,56
1641,preference,35
1642,preferences,50
1643,prefetching,11
1644,prefix,7
1645,preprocessing,8
1646,presence,41
1647,present,5
1648,presentation,5
1649,preservation,20
1650,preserving,107
1651,price,9
1652,primitive,5
1653,principal,23
1654,principle,10
1655,principled,6
1656,principles,11
1657,prior,16
1658,prioritized,5
1659,priors,18
1660,privacy,148
1661,private,19
1662,proactive,16
1663,probabilistic,244
1664,probabilities,16
1665,probability,48
1666,probe,5
1667,probing,5
1668,problem,97
1669,problems,106
1670,procedural,7
1671,procedure,8
1672,process,78
1673,processes,70
1674,processing,287
1675,processor,20
1676,processors,12
1677,producing,5
1678,product,28
1679,production,10
1680,profile,22
1681,profiles,22
1682,profiling,20
1683,profit,8
1684,program,13
1685,programming,120
1686,programs,46
1687,progress,16
1688,progressive,31
1689,project,19
1690,projected,12
1691,projection,34
1692,projections,23
1693,projector,8
1694,proof,11
1695,proofs,5
1696,propagating,6
1697,propagation,43
1698,properties,30
1699,proportional,5
1700,propositional,23
1701,protecting,12
1702,protection,10
1703,protein,41
1704,proteins,6
1705,protocol,23
1706,protocols,11
1707,prototype,18
1708,prototyping,6
1709,provenance,10
1710,providers,7
1711,providing,21
1712,proving,6
1713,provisioning,7
1714,proximity,31
1715,proxy,11
1716,pruning,47
1717,pseudo,25
1718,public,14
1719,publication,7
1720,publish,21
1721,publishing,26
1722,pull,5
1723,purchase,5
1724,pure,6
1725,pursuit,5
1726,push,5
1727,pushing,14
1728,pyramid,6
1729,qos,8
1730,quadratic,5
1731,qualitative,31
1732,quality,77
1733,quantification,5
1734,quantified,15
1735,quantifying,9
1736,quantile,6
1737,quantiles,7
1738,quantitative,21
1739,quasi,13
1740,queries,482
1741,query,651
1742,querying,126
1743,question,74
1744,questions,16
1745,random,109
1746,randomization,9
1747,randomized,22
1748,range,35
1749,rank,61
1750,ranked,22
1751,ranking,180
1752,rankings,11
1753,rapid,14
1754,rare,20
1755,rate,16
1756,rates,7
1757,rating,8
1758,ratings,6
1759,ratio,8
1760,rational,6
1761,rdbms,15
1762,rdf,36
1763,reachability,8
1764,reactive,9
1765,reading,15
1766,real,116
1767,realistic,6
1768,reality,8
1769,reasoning,134
1770,recall,11
1771,recent,9
1772,recognition,159
1773,recognizing,12
1774,recommendation,47
1775,recommendations,18
1776,recommender,27
1777,reconciliation,5
1778,reconciling,6
1779,reconstruction,25
1780,record,27
1781,records,21
1782,recovery,21
1783,recurrent,9
1784,recursive,14
1785,recycling,6
1786,reduce,7
1787,reduced,5
1788,reducing,20
1789,reduction,102
1790,redundancy,20
1791,redundant,13
1792,reference,17
1793,refinement,31
1794,refining,13
1795,reformulation,6
1796,region,26
1797,regions,23
1798,registration,14
1799,regression,127
1800,regret,8
1801,regular,16
1802,regularization,29
1803,regularized,19
1804,regulatory,8
1805,reinforcement,144
1806,related,14
1807,relatedness,8
1808,relation,27
1809,relational,239
1810,relations,46
1811,relationship,36
1812,relationships,30
1813,relative,17
1814,relaxation,11
1815,relaxations,5
1816,relaxed,10
1817,release,5
1818,relevance,137
1819,relevant,39
1820,reliability,6
1821,reliable,14
1822,relief,7
1823,remote,16
1824,removal,7
1825,reordering,6
1826,repairing,7
1827,replacement,6
1828,replica,5
1829,replicated,6
1830,replication,21
1831,report,11
1832,reporting,6
1833,reports,6
1834,repositories,13
1835,repository,10
1836,representation,91
1837,representations,55
1838,representative,11
1839,represented,6
1840,representing,25
1841,reputation,8
1842,requirements,9
1843,rescue,5
1844,research,43
1845,residual,5
1846,resilient,5
1847,resolution,50
1848,resolving,7
1849,resource,50
1850,resources,29
1851,response,18
1852,restoration,8
1853,restricted,9
1854,restrictions,5
1855,result,27
1856,results,104
1857,retrieval,559
1858,retrieving,9
1859,reuse,8
1860,reverse,22
1861,review,8
1862,reviews,8
1863,revision,20
1864,revisited,19
1865,revisiting,8
1866,revolution,5
1867,reward,11
1868,rewards,5
1869,rewrite,5
1870,rewriting,27
1871,rfid,17
1872,right,15
1873,rights,6
1874,risk,21
1875,road,15
1876,robot,73
1877,robotic,8
1878,robotics,6
1879,robots,36
1880,robust,140
1881,robustness,20
1882,roc,20
1883,role,29
1884,roles,6
1885,rotation,7
1886,rough,21
1887,route,5
1888,routing,34
1889,row,5
1890,rss,9
1891,rule,125
1892,rules,189
1893,run,8
1894,running,5
1895,runtime,9
1896,safe,6
1897,safety,8
1898,sales,6
1899,salient,8
1900,sample,31
1901,samples,13
1902,sampling,101
1903,sap,5
1904,sat,31
1905,satisfaction,31
1906,satisfiability,26
1907,scalability,10
1908,scalable,130
1909,scale,141
1910,scaling,39
1911,scan,11
1912,scans,6
1913,scenarios,5
1914,scene,13
1915,scenes,10
1916,scheduling,41
1917,schema,98
1918,schemas,31
1919,scheme,46
1920,schemes,21
1921,science,18
1922,sciences,5
1923,scientific,43
1924,score,18
1925,scores,10
1926,scoring,21
1927,search,750
1928,searches,10
1929,searching,85
1930,second,8
1931,secondary,6
1932,secure,28
1933,security,36
1934,seeking,12
1935,segmentation,101
1936,segmenting,8
1937,segments,11
1938,select,7
1939,selecting,23
1940,selection,273
1941,selections,5
1942,selective,18
1943,selectivity,24
1944,self,96
1945,selling,5
1946,semantic,332
1947,semantically,6
1948,semantics,64
1949,semi,146
1950,semistructured,17
1951,sense,35
1952,senses,5
1953,sensing,18
1954,sensitive,81
1955,sensitivity,13
1956,sensor,92
1957,sensors,7
1958,sensory,5
1959,sentence,21
1960,sentences,12
1961,sentiment,14
1962,separation,7
1963,sequence,68
1964,sequences,86
1965,sequencing,6
1966,sequential,101
1967,series,159
1968,server,44
1969,servers,17
1970,service,99
1971,services,146
1972,session,11
1973,sessions,9
1974,set,103
1975,sets,130
1976,settings,11
1977,several,5
1978,shape,46
1979,shapes,11
1980,shaping,6
1981,shared,28
1982,sharing,51
1983,shedding,19
1984,shift,9
1985,shopping,5
1986,short,16
1987,side,10
1988,signal,9
1989,signals,9
1990,signature,11
1991,signatures,8
1992,significance,9
1993,significant,15
1994,similar,30
1995,similarities,9
1996,similarity,205
1997,simple,56
1998,simplified,6
1999,simulated,6
2000,simulation,21
2001,simultaneous,35
2002,single,44
2003,site,26
2004,sites,39
2005,situation,13
2006,size,34
2007,sizes,6
2008,sketch,16
2009,sketches,9
2010,sketching,6
2011,skewed,9
2012,skill,12
2013,sky,5
2014,skyline,35
2015,skylines,8
2016,slam,5
2017,sliding,24
2018,small,22
2019,smart,13
2020,smooth,8
2021,smoothing,22
2022,snapshot,12
2023,snippet,5
2024,snippets,8
2025,soccer,6
2026,social,116
2027,soft,22
2028,software,35
2029,solution,35
2030,solutions,33
2031,solve,7
2032,solver,10
2033,solving,66
2034,some,17
2035,sorting,10
2036,source,34
2037,sources,59
2038,space,141
2039,spacecraft,7
2040,spaces,55
2041,spam,37
2042,spanning,5
2043,sparse,57
2044,spatial,149
2045,spatially,6
2046,spatio,52
2047,spatiotemporal,11
2048,specific,52
2049,specification,18
2050,specifications,6
2051,specified,6
2052,spectra,6
2053,spectral,52
2054,spectrum,8
2055,speech,32
2056,speed,19
2057,speeding,12
2058,split,7
2059,splitting,12
2060,spoken,13
2061,sponsored,6
2062,spontaneous,5
2063,sql,77
2064,squares,11
2065,stability,11
2066,stable,18
2067,stacking,5
2068,stage,10
2069,standard,8
2070,standards,5
2071,star,13
2072,stars,5
2073,start,5
2074,state,92
2075,states,12
2076,static,24
2077,stationary,7
2078,statistic,5
2079,statistical,102
2080,statistically,5
2081,statistics,36
2082,stemming,7
2083,step,15
2084,steps,5
2085,stereo,23
2086,stochastic,50
2087,stock,10
2088,stopping,5
2089,storage,53
2090,store,6
2091,stores,5
2092,story,11
2093,strategic,7
2094,strategies,56
2095,strategy,38
2096,stratified,7
2097,stream,129
2098,streaming,60
2099,streams,263
2100,strength,7
2101,string,39
2102,strings,6
2103,strong,14
2104,strongly,6
2105,structural,79
2106,structure,201
2107,structured,158
2108,structures,65
2109,structuring,10
2110,student,5
2111,studies,9
2112,study,144
2113,style,15
2114,sub,12
2115,subgraph,10
2116,subgraphs,16
2117,subgroup,11
2118,subject,5
2119,subjective,6
2120,subjectivity,5
2121,subqueries,5
2122,subscribe,21
2123,subscription,6
2124,subsequence,24
2125,subsequences,6
2126,subset,17
2127,subsets,9
2128,subspace,63
2129,subspaces,11
2130,substring,5
2131,substructure,10
2132,substructures,6
2133,subtrees,5
2134,succinct,7
2135,sufficient,5
2136,suffix,13
2137,suggestion,10
2138,suite,9
2139,sum,20
2140,summaries,25
2141,summarisation,6
2142,summarization,92
2143,summarizing,16
2144,summary,17
2145,super,13
2146,superimposed,5
2147,supervised,161
2148,supervision,6
2149,support,228
2150,supported,6
2151,supporting,62
2152,surface,19
2153,surfaces,8
2154,surveillance,25
2155,survey,6
2156,svm,44
2157,svms,24
2158,swarm,6
2159,switching,6
2160,symbolic,23
2161,symmetric,11
2162,symmetries,5
2163,symmetry,9
2164,synchronization,8
2165,synopses,22
2166,synopsis,6
2167,syntactic,20
2168,syntax,7
2169,synthesis,8
2170,synthetic,6
2171,system,410
2172,systematic,12
2173,systems,353
2174,table,22
2175,tables,27
2176,tabular,5
2177,tag,21
2178,tagging,13
2179,tags,6
2180,taking,10
2181,tale,5
2182,taming,6
2183,target,16
2184,targeted,7
2185,targeting,6
2186,task,68
2187,tasks,33
2188,taxonomies,16
2189,taxonomy,14
2190,teaching,5
2191,team,11
2192,teams,6
2193,technique,47
2194,techniques,115
2195,technologies,18
2196,technology,36
2197,telecom,5
2198,template,20
2199,templates,5
2200,temporal,226
2201,temporally,8
2202,tensor,21
2203,terabyte,5
2204,term,94
2205,terminological,7
2206,terms,21
2207,test,54
2208,testbed,5
2209,testing,30
2210,tests,9
2211,text,437
2212,texts,21
2213,textual,23
2214,texture,10
2215,than,17
2216,that,34
2217,the,1828
2218,their,38
2219,thematic,6
2220,theorem,7
2221,theoretic,49
2222,theoretical,18
2223,theories,17
2224,theory,58
2225,there,7
2226,thesaurus,6
2227,they,6
2228,thin,6
2229,third,7
2230,three,14
2231,threshold,17
2232,thresholding,5
2233,through,175
2234,tier,11
2235,tight,7
2236,time,398
2237,times,5
2238,title,5
2239,tolerance,7
2240,tolerant,14
2241,too,5
2242,tool,67
2243,toolkit,9
2244,tools,16
2245,top,91
2246,topic,110
2247,topical,15
2248,topics,24
2249,topological,16
2250,topology,12
2251,topss,5
2252,toward,28
2253,towards,166
2254,trace,5
2255,tracing,8
2256,tracking,118
2257,tractability,8
2258,tractable,21
2259,trade,8
2260,tradeoffs,6
2261,trading,15
2262,traditional,5
2263,traffic,35
2264,trained,7
2265,training,79
2266,trajectories,14
2267,trajectory,16
2268,transaction,32
2269,transactional,17
2270,transactions,12
2271,transcripts,5
2272,transduction,6
2273,transductive,18
2274,transfer,42
2275,transferring,7
2276,transform,12
2277,transformation,24
2278,transformations,17
2279,transition,11
2280,transitions,12
2281,translating,7
2282,translation,53
2283,transliteration,6
2284,transparent,8
2285,transport,8
2286,transportation,8
2287,travel,9
2288,trec,9
2289,tree,223
2290,trees,155
2291,treewidth,7
2292,trend,10
2293,trends,17
2294,trust,26
2295,tuning,40
2296,turning,6
2297,tutorial,7
2298,tutoring,6
2299,twig,19
2300,two,71
2301,type,32
2302,types,13
2303,ubiquitous,7
2304,unbiased,5
2305,uncertain,43
2306,uncertainty,39
2307,uncooperative,5
2308,under,82
2309,understanding,39
2310,unexpected,6
2311,unified,42
2312,uniform,12
2313,unifying,14
2314,unit,11
2315,units,5
2316,universal,12
2317,unknown,13
2318,unlabeled,31
2319,unordered,7
2320,unstructured,26
2321,unsupervised,82
2322,untrusted,5
2323,update,33
2324,updates,34
2325,updating,14
2326,upper,5
2327,urban,7
2328,urls,7
2329,usability,6
2330,usage,19
2331,use,49
2332,used,5
2333,useful,15
2334,user,202
2335,users,37
2336,using,1270
2337,utility,52
2338,utilizing,15
2339,vague,7
2340,validating,7
2341,validation,23
2342,validity,7
2343,value,92
2344,valued,17
2345,values,30
2346,variable,38
2347,variables,27
2348,variance,16
2349,variants,6
2350,variation,8
2351,variational,15
2352,various,8
2353,varying,8
2354,vector,150
2355,vectors,10
2356,vehicle,14
2357,vehicles,5
2358,verification,27
2359,verifying,6
2360,versatile,6
2361,version,11
2362,versions,5
2363,versus,23
2364,vertical,12
2365,vertically,6
2366,very,40
2367,via,235
2368,video,99
2369,videos,11
2370,view,85
2371,viewing,5
2372,viewpoint,7
2373,views,85
2374,virtual,39
2375,visibility,5
2376,visible,5
2377,vision,25
2378,visual,119
2379,visualization,63
2380,visualizing,24
2381,visually,9
2382,vocabulary,11
2383,volume,5
2384,voting,21
2385,walk,20
2386,walking,5
2387,walks,10
2388,warehouse,25
2389,warehouses,17
2390,warehousing,15
2391,warping,16
2392,wavelet,16
2393,wavelets,7
2394,way,27
2395,weak,16
2396,weakly,6
2397,web,1091
2398,weblog,5
2399,webpage,6
2400,website,14
2401,websites,6
2402,weight,15
2403,weighted,67
2404,weighting,35
2405,weights,11
2406,well,7
2407,what,40
2408,when,38
2409,where,6
2410,while,8
2411,who,7
2412,why,24
2413,wide,33
2414,wikipedia,30
2415,wild,6
2416,window,28
2417,windows,21
2418,wireless,39
2419,wise,8
2420,with,1324
2421,within,20
2422,without,52
2423,word,57
2424,wordnet,5
2425,words,29
2426,work,9
2427,workflow,15
2428,workflows,14
2429,working,5
2430,workload,12
2431,workloads,10
2432,workshop,15
2433,world,61
2434,worlds,7
2435,worst,5
2436,wrapper,12
2437,www,10
2438,xml,535
2439,xpath,59
2440,xquery,54
2441,xslt,6
2442,yahoo,7
2443,years,6
2444,yet,6
2445,you,21
2446,your,24
2447,zero,12
